brew "antidote"
brew "biome"
brew "gh"
brew "git"
brew "lsd"
brew "mactop"
brew "mole"
brew "nvm"
brew "starship"
brew "tmux"
cask "alfred"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "ghostty"
cask "imageoptim"
cask "keepingyouawake"
cask "monitorcontrol"