tap "steipete/tap"
brew "antidote"
brew "biome"
brew "ffmpeg"
brew "gh"
brew "git"
brew "lsd"
brew "mactop"
brew "mole"
brew "mysql-client"
brew "node@24"
brew "nvm"
brew "speedtest-cli"
brew "starship"
brew "tmux"
brew "yt-dlp"
cask "alfred"
cask "appcleaner"
cask "chatgpt"
cask "steipete/tap/codexbar"
cask "cursor"
cask "discord"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "ghostty"
cask "imageoptim"
cask "iterm2"
cask "keepingyouawake"
cask "lm-studio"
cask "maccy"
cask "monitorcontrol"
cask "notion"
cask "postman"
cask "signal"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "wavebox"
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "buster.ndjson-colorizer"
vscode "chakrounanas.turbo-console-log"
vscode "codewp.codewp"
vscode "codingyu.laravel-goto-view"
vscode "damms005.devdb"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "glitchbl.laravel-create-view"
vscode "google.wireit"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "ihunte.laravel-blade-wrapper"
vscode "ikappas.composer"
vscode "johnpapa.vscode-peacock"
vscode "kamikillerto.vscode-colorize"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-vscode.makefile-tools"
vscode "naoray.laravel-goto-components"
vscode "neilbrayfield.php-docblocker"
vscode "numso.prettier-standard-vscode"
vscode "oderwat.indent-rainbow"
vscode "ofhumanbondage.react-proptypes-intellisense"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "onecentlin.laravel5-snippets"
vscode "pgl.laravel-jump-controller"
vscode "philsinatra.nested-comments"
vscode "pkief.material-icon-theme"
vscode "rapidapi.vscode-rapidapi-client"
vscode "rapidapi.vscode-services"
vscode "ronnidc.nunjucks"
vscode "ryannaddy.laravel-artisan"
vscode "shufo.vscode-blade-formatter"
vscode "sirtori.indenticator"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "wooodhead.vscode-wrap-console-log-simple"
vscode "wordpresstoolbox.wordpress-toolbox"
vscode "xdebug.php-debug"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
